hvhghv/ESP32-IAP/examples/user_app_template/sdkconfig.defaults
# ============================================================================
# ESP IAP 用户程序 — 关键配置
# ============================================================================
# 这些配置必须与 IAP 程序保持一致，否则无法正常对接。
# ============================================================================

# --- 分区表 ----------------------------------------------------------------
# 使用**分区表 B** (APP 用: nvs + user_app)，位于 flash 0x140000。
# 注意: 与 IAP 的分区表 A (0xB000) 是两份独立文件，互不重叠。
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions_user_app.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x140000

# --- 目标芯片 (按需修改，与 IAP 保持一致) ----------------------------------
# CONFIG_IDF_TARGET="esp32c6"

# --- Flash 大小 ------------------------------------------------------------
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"

# --- 应用入口 --------------------------------------------------------------
# 用户程序作为普通应用运行，标准 app_main 入口即可。
CONFIG_ESP_MAIN_TASK_STACK_SIZE=4096

# --- 日志 ------------------------------------------------------------------
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_DEFAULT_LEVEL=3

# --- 关闭不必要的启动检查，加快启动 ----------------------------------------
# 用户程序由 IAP 校验，无需 bootloader 再校验一次。
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=n

# --- RTC 保留内存 (与 IAP / bootloader 保持一致) ----------------------------
#
# 用户程序通过 IDF 官方 rtc_retain_mem_t.custom[] 读取 IAP 写入的启动参数:
#   rtc_retain_mem_t *mem = bootloader_common_get_rtc_retain_mem();
#   iap_boot_param_t *p = (iap_boot_param_t *)mem->custom;
#
# ⚠️ 这两项**必须与 IAP 程序完全一致**，否则两侧对 custom[] 的
#    偏移/CRC 计算不一致，读到的数据无效。
#
# 详见 docs/FINAL-REPORT.md §5.5
CONFIG_BOOTLOADER_RESERVE_RTC_MEM=y
CONFIG_BOOTLOADER_CUSTOM_RESERVE_RTC=y
# >= sizeof(iap_boot_param_t) = 100 字节，4 字节对齐
CONFIG_BOOTLOADER_CUSTOM_RESERVE_RTC_SIZE=128

# --- 编译器优化 ------------------------------------------------------------
CONFIG_COMPILER_OPTIMIZATION_SIZE=y

# --- FreeRTOS --------------------------------------------------------------
CONFIG_FREERTOS_HZ=1000

# --- 关闭 WiFi 省电 (若用户程序用 WiFi) ------------------------------------
CONFIG_ESP_WIFI_ENABLE_WIFI_RX_STATS=n
